import { FAQ } from "@/types/faq";

const faqData: FAQ[] = [
  {
    id: 1,
    quest: "كيف يمكنني الحصول على تأشيرة دراسية إلى ألمانيا؟",
    ans: "للحصول على تأشيرة دراسية إلى ألمانيا، يجب عليك تقديم قبول جامعي من إحدى الجامعات الألمانية، وإثبات وجود مصدر مالي يغطي مصاريفك، والحصول على تأمين صحي صالح. بعد ذلك، تقدم طلب التأشيرة في السفارة أو القنصلية الألمانية في بلدك.",
  },
  {
    id: 2,
    quest: "ما هي بطاقة الفرص (Chance Card) وهل أنا مؤهل للحصول عليها؟",
    ans: "بطاقة الفرص هي تصريح إقامة يتيح للأفراد غير الأوروبيين الإقامة في ألمانيا لمدة تصل إلى عام للبحث عن عمل. المؤهلات تشمل الحصول على درجة جامعية معترف بها أو تدريب مهني، خبرة مهنية، إتقان اللغة الألمانية، وأن يكون العمر أقل من 35 عامًا.",
  },
  {
    id: 3,
    quest: "ما هي الأوراق المطلوبة للحصول على تأشيرة عمل؟",
    ans: "للحصول على تأشيرة عمل إلى ألمانيا، ستحتاج إلى عرض عمل رسمي من شركة ألمانية، بالإضافة إلى جواز سفر ساري المفعول، تأمين صحي، وإثبات المؤهلات المهنية. تحقق من الشروط المحددة بناءً على مجال عملك.",
  },
  {
    id: 4,
    quest: "هل يمكنني العمل أثناء الدراسة في ألمانيا؟",
    ans: "نعم، يُسمح للطلاب الدوليين بالعمل بدوام جزئي أثناء دراستهم في ألمانيا، بشرط ألا تتجاوز ساعات العمل 120 يومًا بدوام كامل أو 240 يومًا بدوام جزئي في السنة.",
  },
  {
    id: 5,
    quest: "كم من الوقت تستغرق معالجة طلب التأشيرة؟",
    ans: "عادةً ما تستغرق معالجة طلب التأشيرة الدراسية أو العمل من 4 إلى 12 أسبوعًا، حسب نوع التأشيرة وقنصلية بلدك.",
  },
];

export default faqData;
