import { Blog } from "@/types/blog";

const BlogData: Blog[] = [
  // {
  //   _id: 1,
  //   mainImage: "/images/blog/blog-01.png",
  //   title: "جامعة XYZ تقدم منحة دراسية جديدة",
  //   metadata:
  //     "أعلنت جامعة XYZ عن منحة دراسية تغطي التكاليف بالكامل للطلاب الدوليين للعام الدراسي القادم. تعرف على التفاصيل وآلية التقديم.",
  // },
  // {
  //   _id: 2,
  //   mainImage: "/images/blog/blog-02.png",
  //   title: "افتتاح باب التقديم لمنحة الحكومة الألمانية",
  //   metadata:
  //     "أعلنت الحكومة الألمانية عن فتح باب التقديم للمنح الدراسية لعام 2024 للطلاب الراغبين في الدراسة بألمانيا. تعرف على الشروط ومتطلبات القبول.",
  // },
  // {
  //   _id: 3,
  //   mainImage: "/images/blog/blog-03.png",
  //   title: "تحديث جديد بشأن قبول تأشيرات الطلاب",
  //   metadata:
  //     "أصدرت السلطات الألمانية تحديثًا جديدًا حول معالجة طلبات تأشيرات الطلاب، مما يسرّع عملية القبول للعام الحالي.",
  // },
  // {
  //   _id: 4,
  //   mainImage: "/images/blog/blog-04.png",
  //   title: "منحة دراسية في جامعة برلين التقنية",
  //   metadata:
  //     "جامعة برلين التقنية تعلن عن منحة جديدة للطلاب الدوليين في مجالات الهندسة والعلوم التقنية. التفاصيل والشروط داخل المقال.",
  // },
  // {
  //   _id: 5,
  //   mainImage: "/images/blog/blog-05.png",
  //   title: "أفضل النصائح للتقديم على المنح الدراسية",
  //   metadata:
  //     "هل تواجه صعوبة في التقديم للمنح الدراسية؟ نقدم لك نصائح عملية لتحسين فرصك في الحصول على منحة دراسية.",
  // },
  // {
  //   _id: 6,
  //   mainImage: "/images/blog/blog-06.png",
  //   title: "فرص تدريب مدفوعة للطلاب الدوليين في ألمانيا",
  //   metadata:
  //     "تعرف على أحدث فرص التدريب المدفوعة في ألمانيا وكيف يمكنك التقديم عليها كطالب دولي لتعزيز مهاراتك.",
  // },
];

export default BlogData;
